# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [166]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\apolis\anaconda3\lib\site-packages (8.1.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\apolis\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.12)

In [167]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [184]:
import mysql.connector
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="R@@t1234"
    )

### You are required to create a database named 'e_commerce'

In [185]:
cursorObject = connection.cursor()
cursorObject.execute("drop DATABASE E_commerc")
cursorObject.execute("create DATABASE E_commerc")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [186]:
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="R@@t1234",
    database="E_commerc")
cursorObject = connection.cursor()
table_creation_query = """create table supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
                           create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));
                           create table category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));
                           create table product (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
                           create table product_details (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
                           create table orders(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                           create table rating (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""

cursorObject.execute(table_creation_query)

In [187]:
connection.close()
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="R@@t1234",
    database="E_commerc")
cursorObject = connection.cursor(buffered=True)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [188]:
# insert into "supplier" table
table_insertion_query="INSERT INTO supplier(SUPP_ID,SUPP_NAME,SUPP_CITY,SUPP_PHONE) VALUES (%s,%s,%s,%s)"
val = [(1, "Rajesh Retails", "Delhi", "1234567890"),
       (2, "Appario Ltd.", "Mumbai", "2589631470"),
       (3, "Knome products", "Bangalore", "9785462315"),
       (4, "Bansal Retails", "Kochi", "8975463285"),
       (5, "Mittal Ltd.", "Lucknow", "7898456532")]

cursorObject.executemany(table_insertion_query,val);
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [189]:
# insert into "customer" table

table_insertion_query="INSERT INTO customer VALUES (%s,%s,%s,%s,%s)"
val = [ 
(1, 'AAKASH', '9999999999', 'DELHI','M'),
(2, 'AMAN', '9785463215', 'NOIDA','M'),
(3, 'NEHA', '9999999998', 'MUMBAI','F'),
 (4, 'MEGHA', '9994562399', 'KOLKATA','F'),
(5, 'PULKIT', '7895999999', 'LUCKNOW','M')]

cursorObject.executemany(table_insertion_query,val);
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [190]:
# insert into "categoty" table
table_insertion_query="INSERT INTO category VALUES (%s,%s)"
val = [ (1,"BOOKS"),
        (2,"GAMES"),
        (3,"GROCERIES"),
        (4,"ELECTRONICS"),
        (5,"CLOTHES")]
cursorObject.executemany(table_insertion_query,val);
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [191]:
# insert into "product" table
table_insertion_query="INSERT INTO PRODUCT VALUES (%s,%s,%s,%s)"
val = [ (1,"GTA V","DFJDJFDJFDJFDJFJF",2),
        (2,"TSHIRT","DFDFJDFJDKFD",5),
        (3,"ROG LAPTOP","DFNTTNTNTERND",4),
        (4,"OATS","REURENTBTOTH",3),
        (5,"HARRY POTTER","NBEMCTHTJTH",1)]
cursorObject.executemany(table_insertion_query,val);
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [192]:
# insert into "product_details" table
table_insertion_query="INSERT INTO PRODUCT_DETAILS VALUES (%s,%s,%s,%s)"
val = [ (1,1,2,1500),
        (2,3,5,30000),
        (3,5,1,3000),
        (4,2,3,2500),
        (5,4,1,1000)]
cursorObject.executemany(table_insertion_query,val);
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [193]:
# insert into "orders" table
table_insertion_query="INSERT INTO ORDERS(ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) VALUES (%s,%s,%s,%s,%s)"
val = [(20,1500,"2021-10-12",3,5),
        (25,30500,"2021-09-16",5,2),
        (26,2000,"2021-10-05",1,1),
        (30,3500,"2021-08-16",4,1),
        (50,2000,"2021-10-06",2,1)]
cursorObject.executemany(table_insertion_query,val);
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [194]:
# insert into "rating" table
table_insertion_query="INSERT INTO RATING(RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) VALUES (%s,%s,%s,%s)"
val = [(1,2,2,4),
        (2,3,4,3),
        (3,5,1,5),
        (4,1,3,2),
        (5,4,5,4)]
cursorObject.executemany(table_insertion_query,val);
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [195]:
query="""SELECT c.CUS_gender, COUNT(DISTINCT c.CUS_id) AS num_customers FROM customer c INNER JOIN orders o ON c.cus_id = o.cus_id WHERE o.ord_amount >= 3000 GROUP BY c.CUS_gender"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[('F', 1), ('M', 1)]

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [196]:
query="""select * from orders , product_details,product where orders.cus_id=2 and orders.prod_id = product_details.prod_id and product_details.pro_id = product.pro_id"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[(50,
  2000,
  datetime.date(2021, 10, 6),
  2,
  1,
  1,
  1,
  2,
  1500,
  1,
  'GTA V',
  'DFJDJFDJFDJFDJFJF',
  2)]

### Q5) Display the Supplier details who can supply more than one product.

In [197]:
query = """select supplier.* from supplier,product_details where supplier.supp_id in (select product_details.supp_id from product_details group by product_details.supp_id having count(product_details.supp_id)>1) group by supplier.supp_id;"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[(1, 'Rajesh Retails', 'Delhi', '1234567890')]

### Q6) Find the category of the product whose order amount is minimum.

In [198]:
query = """select category.* from orders inner join product_details  on orders.prod_id = product_details.prod_id inner join product on product.pro_id=product_details.pro_id inner join category on category.cat_id = product.cat_id having min('orders.ord_amount);')"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[]

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [199]:
query = """select pro.pro_id, pro.pro_name, ord.ord_date from e_comm.orders ord inner join e_comm.product_details prod on ord.prod_id = prod.prod_id inner join e_comm.product pro on pro.pro_id = prod.pro_id where ord.ord_date > "2021-10-05" order by pro_id"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[(1, 'GTA V', datetime.date(2021, 10, 6)),
 (4, 'OATS', datetime.date(2021, 10, 12))]

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [200]:
query = """ select supplier.supp_id,supplier.supp_name,customer.cus_name,rating.rat_ratstars from rating inner join supplier on rating.supp_id = supplier.supp_id inner join customer on rating.cus_id = customer.cus_id order by rating.rat_ratstars desc limit 3;"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[(1, 'Rajesh Retails', 'PULKIT', 5),
 (2, 'Appario Ltd.', 'AMAN', 4),
 (5, 'Mittal Ltd.', 'MEGHA', 4)]

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [201]:
query = """select cus_name,cus_gender from customer where cus_name like 'A%' or cus_name like '%A';"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[('AAKASH', 'M'), ('AMAN', 'M'), ('NEHA', 'F'), ('MEGHA', 'F')]

### Q10) Display the total order amount of the male customers.

In [202]:
Query = """select sum(orders.ord_amount) as Amount from orders inner join customer on orders.cus_id = customer.cus_id where customer.cus_gender='M';"""
cursorObject.execute(Query)
output = cursorObject.fetchall()
output

[(Decimal('34500'),)]

### Q11) Display all the Customers left outer join with  the orders

In [203]:
query = """SELECT c.*, o.ord_id, o.ord_date, o.ord_amount
FROM customer c
LEFT OUTER JOIN orders o ON c.cus_id = o.cus_id;"""
cursorObject.execute(query)
output = cursorObject.fetchall()
output

[(1,
  'AAKASH',
  '9999999999',
  'DELHI',
  'M',
  26,
  datetime.date(2021, 10, 5),
  2000),
 (2, 'AMAN', '9785463215', 'NOIDA', 'M', 50, datetime.date(2021, 10, 6), 2000),
 (3,
  'NEHA',
  '9999999998',
  'MUMBAI',
  'F',
  20,
  datetime.date(2021, 10, 12),
  1500),
 (4,
  'MEGHA',
  '9994562399',
  'KOLKATA',
  'F',
  30,
  datetime.date(2021, 8, 16),
  3500),
 (5,
  'PULKIT',
  '7895999999',
  'LUCKNOW',
  'M',
  25,
  datetime.date(2021, 9, 16),
  30500)]

In [204]:
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)